Revit 2024 API
BuiltInFailures.InfillFailures.MovedInfillToHost Property
 Infilling element was automatically moved to keep it aligned to host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MovedInfillToHost { get; }
Visual Basic
Public Shared ReadOnly Property MovedInfillToHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MovedInfillToHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.InfillFailures Class
Autodesk.Revit.DB Namespace